1C_Final/Documents/РасчетНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасчетНачислений</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СведенияОДомах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПериодаЗадолженности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифыЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиниц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1C_Final/Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПлательщикиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СведенияОДомах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НазначенныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтмены</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1C_Final/Catalogs/ТарифыЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТарифыЖКХ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗаЕдиницу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1C_Final/Documents/РасчетНачислений/Forms/ФормаДокумента/Ext/Form/Module.bsl
Процедура РассчитатьИЗаполнитьНаСервере()

		Объект.ТабЧасть.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	ТарифыЖКХ.НаименованиеУслуги КАК Услуга,
	|	ТарифыЖКХ.ЦенаЗаЕдиницу * &КоличествоЕдиниц КАК Сумма
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТарифыЖКХ КАК ТарифыЖКХ
	|	ПО (ТарифыЖКХ.НаименованиеУслуги = ЛицевыеСчета.НАзначенныеУслуги.Услуга)
	|ГДЕ
	|	(НЕ ЛицевыеСчета.Ссылка В 
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТабЧастьРасчетов.ЛицевойСчет
	|		ИЗ
	|			Документ.РасчетНачислений.ТабЧасть КАК ТабЧастьРасчетов
	|		ГДЕ
	|			ТабЧастьРасчетов.Ссылка.Проведен = ИСТИНА
	|			И ТабЧастьРасчетов.Ссылка.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца))
	|	И (НЕ &ЕстьОтборПоДому ИЛИ ЛицевыеСчета.Дом = &Дом)");
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ЕстьОтборПоДому", ЗначениеЗаполнено(Объект.Дом));
	Запрос.УстановитьПараметр("Дом", Объект.Дом);
	Запрос.УстановитьПараметр("КоличествоЕдиниц", 1);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ТабЧасть.Добавить();
		НоваяСтрока.ЛицевойСчет = Выборка.ЛицевойСчет;
		НоваяСтрока.Услуга = Выборка.Услуга;
		НоваяСтрока.КоличествоЕдиниц = 1;
		НоваяСтрока.СуммаНачислений = Выборка.Сумма;
		НоваяСтрока.ДатаПериодаЗадолженности = НачалоМесяца(Объект.Дата);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИЗаполнить(Команда)
	РассчитатьИЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабЧастьКоличествоЕдиницПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТабЧасть.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
	РассчитатьСуммуСтрокиНаСервере(ИдентификаторСтроки);	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуСтрокиНаСервере(ИдентификаторСтроки)
	
	СтрокаТабличнойЧасти = Объект.ТабЧасть.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если СтрокаТабличнойЧасти = Неопределено Или СтрокаТабличнойЧасти.Услуга = Неопределено Тогда
		СтрокаТабличнойЧасти.Сумма = 0;
		Возврат;
	КонецЕсли;
	
	Тариф = 0;
	ЗапросТарифа = Новый Запрос(
	"ВЫБРАТЬ
	|	ТарифыЖКХ.ЦенаЗаЕдиницу КАК Тариф
	|ИЗ
	|	Справочник.ТарифыЖКХ КАК ТарифыЖКХ
	|ГДЕ
	|	ТарифыЖКХ.НаименованиеУслуги = &Услуга");
	
	ЗапросТарифа.УстановитьПараметр("Услуга", СтрокаТабличнойЧасти.Услуга);
	РезультатЗапроса = ЗапросТарифа.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаТарифа = РезультатЗапроса.Выбрать();
		ВыборкаТарифа.Следующий();
		Тариф = ВыборкаТарифа.Тариф;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.СуммаНачислений = СтрокаТабличнойЧасти.КоличествоЕдиниц * Тариф;	
КонецПроцедуры
